package lesson19.test;

public class TestQuestions {
    /*
    Что произойдёт при делении на ноль?

a) Вернётся 0
b) Возникнет ArithmeticException
c) Программа продолжит работу
d) Ошибка компиляции

Что делает ключевое слово throws?

a) Ловит исключения
b) Генерирует исключения
c) Пробрасывает исключение в вызывающий код
d) Завершает программу

Какой блок выполняется всегда?

a) try
b) catch
c) finally
d) throw

Что произойдёт, если не обработать проверяемое исключение?

a) Ошибка времени выполнения
b) Ничего
c) Ошибка компиляции
d) Программа завершится с кодом 0
     */
}
